app/views/subjects/index.html.erb

SELECT COUNT(*) FROM `pages` WHERE `pages`.`subject_id` = 9
---
      <td class="center"><%= status_tag(subject.visible) %></td>
      <td class="center"><%= subject.pages.size %></td>