app/controllers/sections_controller.rb

  def new
    @section = Section.new
    @section_count = Section.count + 1
---
SELECT COUNT(*) FROM `sections`