app/controllers/subjects_controller.rb

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 9 LIMIT 1
---
  def show
    @subject = Subject.find(params[:id])

SELECT COUNT(*) FROM `subjects`
---
  def new
    @subject = Subject.new({:name => 'Default'})
    @subject_count = Subject.count + 1

INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('Katya Nekrasova', 10, 1, '2017-06-08 03:29:30', '2017-06-08 03:29:30')
---
  def create
    # Instantiate a new object using form parameters
    @subject = Subject.new(subject_params)
    # Save the object
    if @subject.save

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `subjects`
---
  def edit
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
UPDATE `subjects` SET `position` = 12, `updated_at` = '2017-06-08 03:29:49' WHERE `subjects`.`id` = 15
SELECT COUNT(*) FROM `subjects`
---
  def update
    # Find a new object using form parameters
    @subject = Subject.find(params[:id])
    # Update the object
    if @subject.update_attributes(subject_params)
      # If save succeeds, redirect to the show action
      flash[:notice] = "Subject updated successfully."
      redirect_to(subject_path(@subject))
    else
      # If save fails, redisplay the form so user can fix problems
      @subject_count = Subject.count

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 14 LIMIT 1
---
  def delete
    @subject = Subject.find(params[:id])

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 15 LIMIT 1
DELETE FROM `subjects` WHERE `subjects`.`id` = 15
---
  def destroy
    @subject = Subject.find(params[:id])
    @subject.destroy